Repository: kenan-azd-dev/dotodo
Catalog: lib/l10n/arb/app_*.arb
Languages: ar

# loadingCategoriesError
source: An error occured while loading the categories.
ar: حدث خطأ أثناء تحميل التصنيفات.

# loadingTasksError
source: An error occured while loading the tasks.
ar: حدث خطأ أثناء تحميل المهمات .

source: Hello
ar: مرحبًا

source: Create
ar: إنشاء

source: Edit Category
ar: تعديل التصنيف

# categoryEditDialog
source: Edit the title of your category.
ar: قم بتعديل التصنيف الخاص بك.

source: Categories
ar: التصنيفات

# yourCategoriesEmpty
source: You haven't added any categories yet. Start adding some.
ar: لم تقم بإضافة أية تصنيفات. ابدأ بذلك.

source: Category already exists
ar: هذا التصنيف موجود بالفعل

source: Tasks
ar: المهمات

# createCategory
source: Create a Category
ar: أنشئ تصنيفاً

# categoryHelperDialog
source: Enter the title of your category.
ar: أدخل عنوان التصنيف

source: Your Tasks
ar: مهماتك

# yourTasksEmpty
source: You haven't added any tasks yet. Start adding some.
ar: لم تقم بإضافة أية مهمات. ابدأ بذلك.

source: Settings
ar: الإعدادات

source: Rate the app
ar: قيّم التطبيق

# toggleDark
source: Dark Mode
ar: االوضع الداكن

source: Change Language
ar: تغيير اللغة

source: Change Name
ar: تغيير الاسم

# chooseLang
source: Choose a Language
ar: اختر لغة

# addTask
source: Add a Task
ar: إضافة مهمة

source: Edit Task
ar: تعديل المهمة

# title
source: Task's title
ar: عنوان المهمة

# titleHelper
source: This will be the title of your task
ar: سيكون هذا عنوان مهمتك

# titleError
source: Title cannot be empty!
ar: لا يمكن للعنوان أن يكون فارغاً

source: Category
ar: التصنيف

# categoryHelper
source: Every task should have a category
ar: كل مهمة يجب أن يكون لها تصنيف

# categoryError1
source: Category cannot be empty!
ar: لا يمكن للتصنيف أن يكون فارغاً!

# categoryError2
source: Category's length shouldn't be more than 20 charecters!
ar: لا يجب أن يكون طول التصنيف أكثر من 20 حرف

source: Date
ar: التاريخ

source: Time
ar: الوقت

source: Description
ar: الوصف

# descriptionHelper
source: (Optional)
ar: (إختياري)

source: Add
ar: إضافة

# editName
source: Edit Your Name
ar: قم بتعديل اسمك

# nameNickname
source: Your name or nickname
ar: اسمك أو لقبك

# nameHelper
source: Kindly enter your name or nickname
ar: لطفاً أدخل اسمك أو لقبك

source: Edit
ar: تعديل

source: Go Back
ar: العودة

# nameError1
source: Name cannot be empty!
ar: لا يمكن للاسم أن يكون فارغاً!

# nameError2
source: Name's length shouldn't be more than 20 charecters!
ar: لا يجب أن يكون طول الاسم أكثر من 20 حرف!

# todayTasks
source: Today's Tasks
ar: مهمات اليوم

# todayTasksEmpty
source: You don't have any tasks today. Enjoy.
ar: ليس لديك أية مهمات اليوم. استمتع بيومك.

source: Due Time
ar: الوقت المحدد

source: Due Date
ar: التاريخ المحدد

# dueTimeEmpty
source: You didn't provide a due time for this task
ar: لم تقم بتحديد الوقت.

# dueDateEmpty
source: You didn't provide a due date for this task
ar: لم تقم بتحديد التاريخ.

# descriptionEmpty
source: You didn't provide a description for this task
ar: لم تقم بتحديد الوصف.

# deleteTaskDialogTitle
source: Are you sure you want to delete this task?
ar: هل أنت متأكد من أنك تريد القيام بحذف المهمة؟

source: Yes
ar: نعم

# deleteCategoryDialogTitle
source: Are you sure you want to delete this Category?
ar: هل أنت متأكد من أنك تريد القيام بحذف التصنيف؟

# deleteCategoryDialogContent
source: All tasks under this category will be deleted too.
ar: سيتم حذف جميع المهمات المدرجة تحت هذا التصنيف

# dailyNotifications
source: Daily Quotes Notifications
ar: إشعارات الاقتباسات اليومية

# categoryTaskEmpty
source: You haven't added any task to this category. Start adding some.
ar: لم تقم بإضافة أية مهمات إلى هذا التصنيف بعد. ابدأ بذلك.

# allowNotificationsDialog
source: Do you want to allow this app to send you notifications?
ar: هل تريد السماح لهذا التطبيق بإرسال الإشعارات؟

source: Manage Your Tasks
ar: قم بإدارة مهماتك

# manageYourTasksDescription
source: Add, edit, delete, categorize your tasks the way you want!
ar: أضف، عدّل ، احذف وصنّف مهماتك بالطريقة التي تريدها!

# availableLanguages
source: Available in 3 Languages
ar: متوفر بـ 3 لغات

# availableLanguagesDescription
source: English, French and Arabic
ar: الإنكليزية والفرنسية والعربية

source: Don't Miss Out!
ar: لا تفوّت شيئًا

# dontMissOutDescription
source: When specifying the due date and the due date time of your task you'll be notified on time.
ar: عندما تقوم بتحديد تاريخ ووقت للمهمة سيتم إعلامك في الوقت المحدد.

source: Let's get started
ar: لنبدأ

source: Next
ar: التالي

source: Skip
ar: تخطي

source: Tasks Calendar
ar: تقويم المهمات

# submit
source: Let's Go!
ar: هيّا بنا!

# rate
source: Enjoying do ToDo? Kindly, rate it on Play Store.
ar: هل تستمتع بـ do ToDo؟ لطفاً قيّمه في متجر Play

# rateDescription
source: We hope that you're having a good time with do Todo. Whether you like the app or feel we could do better, we want to know!
ar: نأمل أنك تقضي وقتًا ممتعًا مع do Todo. سواء أعجبك التطبيق أو تشعر أنه يمكننا القيام بعمل أفضل ، نريد أن نعرف!

source: Proceed
ar: تقدم

source: About
ar: حول التطبيق

source: New Version
ar: إصدار جديد

# newVersionTitle
source: A New Update is Available!
ar: تحديث جديد متاح!

# features
source: do ToDo is a simple, straightforward task mangagment app deveolped using Flutter. App features: 1. Add tasks and specifiy a description, due date and due time to it. 2. For the tasks to be more organized, you have to specifiy the category for evey task you add. 3. When specifing the due date and due date for the task, you will recieve a notification on the selected date and time. 4. Available in three languages, English, French and Arabic. 5. Available in dark mode.
ar: يعد تطبيق do ToDo تطبيقاً بسيطاً ومباشراً لإدارة المهام تم تطويره باستخدام Flutter. مميزات التطبيق: 1. أضف المهام وحدد وصفًا وتاريخاً ووقتاً لها. 2. لكي تكون المهام أكثر تنظيماً، عليك تحديد تصنيف كل مهمة تقوم بإضافتها. 3. عند تحديد تاريخ ووقت مهمة ما، سيصلك إشعار في الوقت والتاريخ المحددين. 4. متوفر بثلاث لغات، الإنكليزية، والفرنسية ، والعربية. 5. متوفر بالوضع المظلم.

# developedBy
source: Developed with love by: Kenan Abo Zaineddin.
ar: تم تطوير التطبيق بواسطة: كنان أبو زين الدين

# linkedIn
source: My LinkedIn Account
ar: حسابي على اللينكدإن

source: Your Ongoing Tasks
ar: مهماتك الجارية

# goodJobCompletedTasks
source: Good Job! Looks like you've completed all your tasks
ar: عمل جيد! يبدو أنك قد أكملت جميع مهامك

source: All Tasks
ar: كل المهام

source: Completed Tasks
ar: المهمات المنجزة

source: Ongoing Tasks
ar: المهمات الجارية

# clickOnArrowSuggestions
source: Click on the arrow for suggestions.
ar: اضغط على السهم للاقتراحات.

# allTasksTooltip
source: All Tasks.
ar: جميع المهمات.

# errorOccured
source: An error occured, that's all we know
ar: حدث خطأ ما، هذا كل ما نعرفه.

source: Add Category
ar: إضافة تصنيف
